app/controllers/store_controller.rb

  def index
    @products = Product.find_products_for_sale
---
SELECT * FROM `products` ORDER BY title

  def add_to_cart
    product = Product.find(params[:id])
---
SELECT * FROM `products` WHERE (`products`.`id` = 4)

  def save_order
    @order = Order.new(params[:order])
    @order.add_line_items_from_cart(@cart)
    if @order.save
---
INSERT INTO `line_items` (`order_id`, `updated_at`, `total_price`, `product_id`, `quantity`, `created_at`) VALUES(1, '2009-06-27 03:10:02', 27.75, 6, 1, '2009-06-27 03:10:02')
INSERT INTO `orders` (`name`, `updated_at`, `pay_type`, `address`, `email`, `created_at`) VALUES('sumit', '2009-06-27 03:10:02', 'cc', '1870', 's@y', '2009-06-27 03:10:02')