app/controllers/users_controller.rb

  def index
    @users = User.find(:all, :order => :name)
---
SELECT * FROM `users` WHERE (`users`.`id` IS NULL) LIMIT 1

  def show
    @user = User.find(params[:id])
---
SELECT * FROM `users` WHERE (`users`.`id` IS NULL) LIMIT 1

  def edit
    @user = User.find(params[:id])
---
SELECT * FROM `users` WHERE (`users`.`id` IS NULL) LIMIT 1

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO `users` (`name`, `salt`, `updated_at`, `hashed_password`, `created_at`) VALUES('dave', '198971300.110943936896223', '2009-06-27 04:39:00', '25b7a978de8f38e62a190c8cc45232812f928c33', '2009-06-27 04:39:00')

  def update
    @user = User.find(params[:id])
---
SELECT * FROM `users` WHERE (`users`.`id` IS NULL) LIMIT 1

  def destroy
    @user = User.find(params[:id])
    begin
      flash[:notice] = "User #{@user.name} deleted"
      @user.destroy
---
SELECT * FROM `users` WHERE (`users`.`id` IS NULL) LIMIT 1
DELETE FROM `users` WHERE `id` = 1